indianagio/sk6812-sniffer/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32h2"

# USB CDC on boot (so UART0 = USB serial)
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Increase UART TX buffer for high throughput
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

# RMT
CONFIG_RMT_ISR_IRAM_SAFE=y
